deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino

#include "ActionsList.h"
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Fonts/Org_01.h>

#ifdef __AVR_ATmega328P__ || __AVR_ATmega168__
#define ARDUINO_ARCH_UNO
#endif

#define FONT_BASELINE_CORRECTION_NORMAL 6
#define FONT_BASELINE_CORRECTION_LARGE 12
#define MS_FONT_TEXT_SIZE_NORMAL 1
#define MS_FONT_TEXT_SIZE_LARGE 2

const char* MS_OFF_STRING = "OFF";
const char* MS_ON_STRING = "ON";
const char* MS_BACK_BUTTON_PROMPT = "B1 - Back";
const char* MS_READING_PROMPT_TEXT = "Reading...";

const char* MS_FAR_ACTIVE_SETTING_KEY = "far-active";
const char* MS_MID_ACTIVE_SETTING_KEY = "mid-active";
const char* MS_NEAR_ACTIVE_SETTING_KEY = "near-active";

const char* MS_FAR_WET_SETTING_KEY = "wet-far";
const char* MS_MID_WET_SETTING_KEY = "wet-mid";
const char* MS_NEAR_WET_SETTING_KEY = "wet-near";

const char* MS_FAR_DRY_SETTING_KEY = "dry-far";
const char* MS_MID_DRY_SETTING_KEY = "dry-mid";
const char* MS_NEAR_DRY_SETTING_KEY = "dry-near";

const char* MS_APV_SETTING_KEY = "apv";
const char* MS_DAPV_SETTING_KEY = "dapv";

const char* MS_PUMP_MAX_DURATION = "p-max";
const char* MS_PUMP_REACT_INT_DURATION = "p-react";

const char* MS_SENSOR_INTERVAL_DRY = "s-dry";
const char* MS_SENSOR_INTERVAL_PUMPING = "s-pumping";


#ifdef ARDUINO_ARCH_ESP32

#include <Preferences.h>
#define MS_PREFERENCES_ID "msys"

#else
#include <EEPROM.h>
#define _max max
#define _min min
#endif

#define MS_BUTTON1 1
#define MS_BUTTON2 2
#define MS_BUTTON3 3
#define MS_BUTTON4 4

#define SCREENS_COUNT 8

#define MS_HOME_SCREEN 0
#define MS_SETTINGS_SCREEN 1
#define MS_SENSOR_SETTINGS_SCREEN 2
#define MS_THRESHOLDS_SETTINGS_SCREEN 3
#define MS_INTERVALS_SETTINGS_SCREEN 4
#define MS_PUMP_INTERVALS_SETTINGS_SCREEN 5
#define MS_SENSOR_INTERVALS_SETTINGS_SCREEN 6
#define MS_STATS_SCREEN 7

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels

#define DEFAULT_TEXT_SIZE 2

#define DEFAULT_FONT Org_01

#define MS_H_CENTER 1
#define MS_H_LEFT 2
#define MS_H_RIGHT 4
#define MS_V_CENTER 8
#define MS_V_TOP 16
#define MS_V_BOTTOM 32


// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
// The pins for I2C are defined by the Wire-library. 
// On an arduino UNO:       A4(SDA), A5(SCL)
// On an arduino MEGA 2560: 20(SDA), 21(SCL)
// On an arduino LEONARDO:   2(SDA),  3(SCL), ...
#define OLED_RESET     4 // Reset pin # (or -1 if sharing Arduino reset pin)
#define SCREEN_ADDRESS 0x3C ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

#ifdef ARDUINO_ARCH_ESP32

#define BUTTON_1_LOW 500
#define BUTTON_1_HIGH 1700

#define BUTTON_2_LOW 2000
#define BUTTON_2_HIGH 2400

#define BUTTON_3_LOW 2900
#define BUTTON_3_HIGH 3500

#define BUTTON_4_LOW 3800
#define BUTTON_4_HIGH 4500

Preferences preferences;

#define PUMP_PIN 27
#define SENSOR_PIN 14

#define SENSOR_PIN_HIGH LOW
#define PUMP_PIN_HIGH LOW
#define SENSOR_PIN_LOW HIGH
#define PUMP_PIN_LOW HIGH

#ifdef ARDUINO_ARCH_ESP32
#define PIN_FAR 34
#define PIN_MID 35
#define PIN_NEAR 32
#endif

#ifndef ARDUINO_ARCH_ESP32
#define PIN_FAR A0
#define PIN_MID A1
#define PIN_NEAR A2
#endif

#define PIN_VALVE_FAR 33
#define PIN_VALVE_MID 25
#define PIN_VALVE_NEAR 26

#define BUTTONS_PIN 12

#endif
#ifndef ARDUINO_ARCH_ESP32

#define BUTTON_1_LOW 100
#define BUTTON_1_HIGH 280

#define BUTTON_2_LOW 300
#define BUTTON_2_HIGH 450

#define BUTTON_3_LOW 500
#define BUTTON_3_HIGH 600

#define BUTTON_4_LOW 650
#define BUTTON_4_HIGH 1024

#define PUMP_PIN 4
#define SENSOR_PIN 2

#define SENSOR_PIN_HIGH LOW
#define PUMP_PIN_HIGH LOW
#define SENSOR_PIN_LOW HIGH
#define PUMP_PIN_LOW HIGH

#define PIN_FAR A0
#define PIN_MID A1
#define PIN_NEAR A2

#define PIN_VALVE_FAR 10
#define PIN_VALVE_MID 11
#define PIN_VALVE_NEAR 12

#define BUTTONS_PIN A3

#endif

#define SENSORS_COUNT 3

#define MS_SENSOR_FAR  0
#define MS_SENSOR_MID  1
#define MS_SENSOR_NEAR  2

#define ACTIONS_COUNT 6

// action defines
#define SENSORS_ACTION 0
#define OUTLET_FAR_ACTION 1
#define OUTLET_MID_ACTION 2
#define OUTLET_NEAR_ACTION 3
#define PUMP_ACTION 4
#define DRAW_HOME_ACTION 5


// end of action defines

//#undef DEBUG
#define DEBUG


// Structures

struct MSScreenBox {
	int x;
	int y;
	int w;
	int h;
};

struct MSysSettings {
	unsigned long siw = 5000; // 5 seconds for sensor interval while watering
	unsigned long sid = 60000 * 1; // 1 minute for sensor interval while in stand by
	unsigned long sd = 1000; // 1 second max duration for sensor activation;
	unsigned long pi = 60000 * 10; // 10 minutes between pump activations
	unsigned long pd = 60000 * 2; // 2 minutes max pump on duration
	long apv = 50; // % humidity threshold for pump activation
	long dapv = 85; // % humidity threshold for pump deactivation
} settings;

struct Sensor {
	int wet; // completely wet reading
	int dry; // completely dry reading
	int value; // current reading
	int ai; // action index
	int p; // humidity percentage
	bool active = true;
	char name[4];
};

struct SystemState {
	int scr = MS_HOME_SCREEN; // current screen
	Sensor* s = nullptr;      // array of sensors and their state
	bool p = false;			  // indicates whether the pump is active
	bool sa = false;          // indicates whether the sensors are active
	bool vn = false;          // indicates whether the near outlet is open
	bool vm = false;          // indicates whether the mid outlet is open
	bool vf = false;          // indicates whether the far outlet is open
} state;



// An array used for iterating over scheduled
// actions and executing them
Action* availableActions = nullptr;

ActionsList executionList;

struct MSScreen {
	void (*handleButtons)(int buttonValue);
	void (*drawUI)(Action* a);
	int code;
};


// An array containing the available screens
MSScreen* availableScreens;

struct ButtonState {
	int value = 0;
	bool hasChanged = false;
} button;
// end of structures

// Helpers

// Display

void initCanvas(GFXcanvas16* c) {
	(*c).setFont(&DEFAULT_FONT);
	(*c).setTextColor(SSD1306_WHITE);
}

void printPositionedText(GFXcanvas16* canvas, const char* text, int x, int y) {
	(*canvas).setCursor(x, y);
	(*canvas).print(text);
}

MSScreenBox printAlignedText(GFXcanvas16* canvas, const char* text, int textSize, int align = MS_H_CENTER | MS_V_CENTER) {
	int fontCorrection = textSize == MS_FONT_TEXT_SIZE_NORMAL ? FONT_BASELINE_CORRECTION_NORMAL : FONT_BASELINE_CORRECTION_LARGE;
	int16_t mx, my;
	uint16_t mw, mh;
	(*canvas).setTextSize(textSize);
	(*canvas).getTextBounds(text, 0, 0, &mx, &my, &mw, &mh);
	(*canvas).setTextColor(SSD1306_WHITE);
	int16_t x = 0;
	int16_t y = 0;

	if ((MS_H_CENTER & align) != 0) {
		x = (int16_t)(SCREEN_WIDTH / 2 - mw / 2);
	}
	else if ((MS_H_LEFT & align) != 0) {
		x = 0;
	}
	else if ((MS_H_RIGHT & align) != 0) {
		x = SCREEN_WIDTH - mw;
	}


