deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	if ((MS_V_CENTER & align) != 0) {
		y = (int16_t)(SCREEN_HEIGHT / 2 - mh / 2);
	}
	else if ((MS_V_TOP & align) != 0) {
		y = fontCorrection;
	}
	else if ((MS_V_BOTTOM & align) != 0) {
		y = SCREEN_HEIGHT - (mh + fontCorrection);
	}
	printPositionedText(canvas, text, x, y);

	return { x, y, mw, mh };
}

MSScreenBox printAlignedTextStack(
	GFXcanvas16* canvas,
	char** text,
	int arraySize,
	int textSize,
	int align,
	int boxAlign = MS_H_CENTER | MS_V_CENTER,
	int spacing = 3) {
	int boxHeight = 0;
	int boxWidth = 0;


	int fontCorrection = textSize == MS_FONT_TEXT_SIZE_NORMAL ? FONT_BASELINE_CORRECTION_NORMAL : FONT_BASELINE_CORRECTION_LARGE;
	boxHeight += spacing * (arraySize - 1) + fontCorrection;
	(*canvas).setTextSize(textSize);

	char** cpointer = text;
	for (int i = 0; i < arraySize; i++) {
		int16_t cx, cy;
		uint16_t cw, ch;
		(*canvas).getTextBounds((*cpointer), 0, 0, &cx, &cy, &cw, &ch);
		boxHeight += ch;

		if (cw > boxWidth) {
			boxWidth = cw;
		}
		cpointer++;
	}

	GFXcanvas16 boxCanvas(boxWidth, boxHeight);
	initCanvas(&boxCanvas);
	boxCanvas.setTextSize(textSize);

	cpointer = text;
	int yCoord = fontCorrection; //offset correction due to font
	int xCoord = 0;
	for (int i = 0; i < arraySize; i++) {
		int16_t cx, cy;
		uint16_t cw, ch;
		boxCanvas.getTextBounds((*cpointer), 0, 0, &cx, &cy, &cw, &ch);

		switch (align) {
		case MS_H_LEFT:
			xCoord = boxWidth / 2 - boxWidth / 2;
			break;
		case MS_H_CENTER:
			xCoord = boxWidth / 2 - cw / 2;
			break;
		case MS_H_RIGHT:
			xCoord = boxWidth - cw;
			break;
		}

		printPositionedText(&boxCanvas, (*cpointer), xCoord, yCoord);
		cpointer++;
		yCoord += (ch + spacing);
	}


	int boxX = 0, boxY = 0;
	int screenWidth = (*canvas).width();
	int screenHeight = (*canvas).height();

	if ((MS_H_CENTER & boxAlign) != 0) {
		boxX = (int16_t)(screenWidth / 2 - boxWidth / 2);
	}
	else if ((MS_H_LEFT & boxAlign) != 0) {
		boxX = 0;
	}
	else if ((MS_H_RIGHT & boxAlign) != 0) {
		boxX = screenWidth - boxWidth;
	}


	if ((MS_V_CENTER & boxAlign) != 0) {
		boxY = (int16_t)(screenHeight / 2 - boxHeight / 2);
	}
	else if ((MS_V_TOP & boxAlign) != 0) {
		boxY = 0;
	}
	else if ((MS_V_BOTTOM & boxAlign) != 0) {
		boxY = screenHeight - boxHeight;
	}

	(*canvas).drawRGBBitmap(boxX, boxY, boxCanvas.getBuffer(), boxWidth, boxHeight);

	return { boxX, boxY, boxWidth, boxHeight };;
}

void drawStartingPromptScreen(Adafruit_SSD1306* display) {
	char* prompt[] = { "Actions:", "B1 - start", "B2 - init" };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, prompt, 3, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawDryValuesScreen(Adafruit_SSD1306* display) {
	char nearA[15], midA[15], farA[15];
	sprintf(nearA, "Near: %d", state.s[MS_SENSOR_NEAR].dry);
	sprintf(midA, "Mid: %d", state.s[MS_SENSOR_MID].dry);
	sprintf(farA, "Far: %d", state.s[MS_SENSOR_FAR].dry);

	char* message[] = { "Dry values:", nearA, midA, farA };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawWetValuesScreen(Adafruit_SSD1306* display) {
	char nearA[15], midA[15], farA[15];
	sprintf(nearA, "Near: %d", state.s[MS_SENSOR_NEAR].wet);
	sprintf(midA, "Mid: %d", state.s[MS_SENSOR_MID].wet);
	sprintf(farA, "Far: %d", state.s[MS_SENSOR_FAR].wet);

	char* message[] = { "Wet values:", nearA, midA, farA };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawStartingValuesScreen(Adafruit_SSD1306* display) {
	drawDryValuesScreen(display);
	delay(5000);
	drawWetValuesScreen(display);
	delay(5000);

	(*display).clearDisplay();
	char apv[15], dapv[15];
	sprintf(apv, "APV: %d%%", settings.apv);
	sprintf(dapv, "DAPV: %d%%", settings.dapv);

	char* message[] = { "Thresholds:", apv, dapv };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 3, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void showTextCaptionScreen(Adafruit_SSD1306* display, const char* caption) {
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedText(&canvas, caption, 2, MS_V_CENTER | MS_H_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void showActionPromptScreen(Adafruit_SSD1306* display, char* btn, char* action) {
	char btnstr[10];
	sprintf(btnstr, "Press %s to", btn);
	char* message[] = { btnstr, action };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 3, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawSplashScreen(Adafruit_SSD1306* display) {
	char* texts[] = { "Irrigation", "System", "Version: 0.1" };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	canvas.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT, 10, SSD1306_WHITE);
	printAlignedTextStack(&canvas, texts, 3, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

// end of Display

void populateScreens() {
	availableScreens[MS_HOME_SCREEN].drawUI = &drawHomeScreen;
	availableScreens[MS_HOME_SCREEN].handleButtons = &handleHomeScreen;

	availableScreens[MS_SETTINGS_SCREEN].drawUI = &drawSettingsScreen;
	availableScreens[MS_SETTINGS_SCREEN].handleButtons = &handleSettingsScreen;

