deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	availableScreens[MS_SENSOR_SETTINGS_SCREEN].drawUI = &drawSensorSettingsScreen;
	availableScreens[MS_SENSOR_SETTINGS_SCREEN].handleButtons = &handleSensorSettingsScreen;

	availableScreens[MS_THRESHOLDS_SETTINGS_SCREEN].drawUI = &drawThresholdsSettingsScreen;
	availableScreens[MS_THRESHOLDS_SETTINGS_SCREEN].handleButtons = &handleThresholdsSettingsScreen;

	availableScreens[MS_INTERVALS_SETTINGS_SCREEN].drawUI = &drawIntervalsSettingsScreen;
	availableScreens[MS_INTERVALS_SETTINGS_SCREEN].handleButtons = &handleIntervalsSettingsScreen;

	availableScreens[MS_PUMP_INTERVALS_SETTINGS_SCREEN].drawUI = &drawPumpIntervalsSettingsScreen;
	availableScreens[MS_PUMP_INTERVALS_SETTINGS_SCREEN].handleButtons = &handlePumpIntervalsSettingsScreen;

	availableScreens[MS_SENSOR_INTERVALS_SETTINGS_SCREEN].drawUI = &drawSensorIntervalsSettingsScreen;
	availableScreens[MS_SENSOR_INTERVALS_SETTINGS_SCREEN].handleButtons = &handleSensorIntervalsSettingsScreen;

	availableScreens[MS_STATS_SCREEN].drawUI = &drawStatisticsScreen;
	availableScreens[MS_STATS_SCREEN].handleButtons = &handleStatisticsScreen;
}

void populateActions() {


	// read sensors action
	availableActions[SENSORS_ACTION].tick = &tickSensors;
	availableActions[SENSORS_ACTION].frozen = true;
	availableActions[SENSORS_ACTION].stopRequested = false;
	availableActions[SENSORS_ACTION].start = &startSensors;
	availableActions[SENSORS_ACTION].stop = &stopSensors;
	availableActions[SENSORS_ACTION].ti = settings.siw;
	availableActions[SENSORS_ACTION].td = settings.sd;
	availableActions[SENSORS_ACTION].to = 200;
	availableActions[SENSORS_ACTION].clear = false;
	availableActions[SENSORS_ACTION].state = MS_NON_ACTIVE;
	availableActions[SENSORS_ACTION].child = nullptr;
	availableActions[SENSORS_ACTION].lst = 0;
	availableActions[SENSORS_ACTION].st = 0;

	// open far valve action
	availableActions[OUTLET_FAR_ACTION].tick = &tickFarOutlet;
	availableActions[OUTLET_FAR_ACTION].frozen = false;
	availableActions[OUTLET_FAR_ACTION].stopRequested = false;
	availableActions[OUTLET_FAR_ACTION].start = &startFarOutlet;
	availableActions[OUTLET_FAR_ACTION].stop = &stopFarOutlet;
	availableActions[OUTLET_FAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_FAR_ACTION].td = settings.pd;
	availableActions[OUTLET_FAR_ACTION].clear = false;
	availableActions[OUTLET_FAR_ACTION].to = 0;
	availableActions[OUTLET_FAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_FAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_FAR_ACTION].lst = 0;
	availableActions[OUTLET_FAR_ACTION].st = 0;


	state.s[MS_SENSOR_FAR].ai = OUTLET_FAR_ACTION;

	// open mid valve action
	availableActions[OUTLET_MID_ACTION].tick = &tickMidOutlet;
	availableActions[OUTLET_MID_ACTION].frozen = false;
	availableActions[OUTLET_MID_ACTION].stopRequested = false;
	availableActions[OUTLET_MID_ACTION].start = &startMidOutlet;
	availableActions[OUTLET_MID_ACTION].stop = &stopMidOutlet;
	availableActions[OUTLET_MID_ACTION].ti = settings.pi;
	availableActions[OUTLET_MID_ACTION].td = settings.pd;
	availableActions[OUTLET_MID_ACTION].clear = false;
	availableActions[OUTLET_MID_ACTION].to = 0;
	availableActions[OUTLET_MID_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_MID_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_MID_ACTION].lst = 0;
	availableActions[OUTLET_MID_ACTION].st = 0;

	state.s[MS_SENSOR_MID].ai = OUTLET_MID_ACTION;

	// open near valve action
	availableActions[OUTLET_NEAR_ACTION].tick = &tickNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].frozen = false;
	availableActions[OUTLET_NEAR_ACTION].stopRequested = false;
	availableActions[OUTLET_NEAR_ACTION].start = &startNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].stop = &stopNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_NEAR_ACTION].td = settings.pd;
	availableActions[OUTLET_NEAR_ACTION].clear = false;
	availableActions[OUTLET_NEAR_ACTION].to = 0;
	availableActions[OUTLET_NEAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_NEAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_NEAR_ACTION].lst = 0;
	availableActions[OUTLET_NEAR_ACTION].st = 0;

	state.s[MS_SENSOR_NEAR].ai = OUTLET_NEAR_ACTION;

	// start pump action
	availableActions[PUMP_ACTION].tick = &tickPump;
	availableActions[PUMP_ACTION].frozen = false;
	availableActions[PUMP_ACTION].stopRequested = false;
	availableActions[PUMP_ACTION].start = &startPump;
	availableActions[PUMP_ACTION].stop = &stopPump;
	availableActions[PUMP_ACTION].ti = 0;
	availableActions[PUMP_ACTION].td = 0;
	availableActions[PUMP_ACTION].clear = false;
	availableActions[PUMP_ACTION].to = 0;
	availableActions[PUMP_ACTION].state = MS_NON_ACTIVE;
	availableActions[PUMP_ACTION].child = nullptr;
	availableActions[PUMP_ACTION].lst = 0;
	availableActions[PUMP_ACTION].st = 0;


	// draw home action
	availableActions[DRAW_HOME_ACTION].tick = &tickBuildScreen;
	availableActions[DRAW_HOME_ACTION].frozen = true;
	availableActions[DRAW_HOME_ACTION].stopRequested = false;
	availableActions[DRAW_HOME_ACTION].start = &startBuildScreen;
	availableActions[DRAW_HOME_ACTION].stop = &stopBuildScreen;
	availableActions[DRAW_HOME_ACTION].ti = 1000;
	availableActions[DRAW_HOME_ACTION].td = 100;
	availableActions[DRAW_HOME_ACTION].clear = false;
	availableActions[DRAW_HOME_ACTION].to = 0;
	availableActions[DRAW_HOME_ACTION].state = MS_NON_ACTIVE;
	availableActions[DRAW_HOME_ACTION].child = nullptr;
	availableActions[DRAW_HOME_ACTION].lst = 0;
	availableActions[DRAW_HOME_ACTION].st = 0;
}

int readButton() {
	return analogRead(BUTTONS_PIN);
}

void setupInitialState() {
	if (availableActions != nullptr) {
		populateScreens();
		populateActions();
		state.scr = MS_HOME_SCREEN;
		scheduleAction(&executionList, &availableActions[SENSORS_ACTION]);
		scheduleAction(&executionList, &availableActions[DRAW_HOME_ACTION]);
	}
	else {
#ifdef DEBUG
		Serial.println(F("MEM: Actions"));
#endif
	}
}


void extractMedianPinValueForProperty(int delayInterval, int* near, int* mid, int* far) {
	int farV = 0;
	int midV = 0;
	int nearV = 0;

	for (int i = 0; i < 10; i++) {
		farV += analogRead(PIN_FAR);
		midV += analogRead(PIN_MID);
		nearV += analogRead(PIN_NEAR);
		if (delayInterval > 0) {
			delay(delayInterval);
		}
	}

