deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	(*far) = (int)(farV / 10);
	(*mid) = (int)(midV / 10);
	(*near) = (int)(nearV / 10);
}

// End of Helpers

// Actions

// Outlets

// Far

void startFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, LOW);
	state.vf = true;
}

void tickFarOutlet(Action* a) {
}

void stopFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, HIGH);
	state.vf = false;
}

// end of Far

// Mid

void startMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, LOW);
	state.vm = true;
}

void tickMidOutlet(Action* a) {
}

void stopMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, HIGH);
	state.vm = false;
}

// end of Mid

// Near

void startNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, LOW);
	state.vn = true;
}

void tickNearOutlet(Action* a) {
}

void stopNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, HIGH);
	state.vn = false;
}

// end of Near
//

// Sensors

void startSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
	state.sa = true;
}

void stopSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	state.sa = false;
}

void tickSensors(Action* a) {

	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_NEAR].value, &state.s[MS_SENSOR_MID].value, &state.s[MS_SENSOR_FAR].value);

	bool activate = false;
	Action** acandidates = (Action**)malloc(sizeof(Action*) * SENSORS_COUNT);
	int pc = 0;
	int ac = 0;
	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* se = &state.s[i];
		Action* ca = &availableActions[(*se).ai];
		float v = (float)(*se).value;
		float d = (float)(*se).dry;
		float w = (float)(*se).wet;
		float dwd = _max(0.00001, d - w);

		float mp = ((d - _min(_max(v, w), d)) / dwd) * 100.0;
		(*se).p = (int)mp;
#ifdef DEBUG
		Serial.print(F("%: "));
		Serial.print(mp);
		Serial.println();
#endif
		activate = (*se).active && (bool)((long)mp < (state.p ? settings.dapv : settings.apv));

		acandidates[i] = nullptr;
		if (activate && ca != nullptr) {
			ac++;
			if ((*ca).state == MS_NON_ACTIVE) {
				acandidates[i] = ca;
				pc++;
			}
			else if ((*ca).state == MS_PENDING) {
				requestStop(&executionList, ca);
			}
		}
		else if (ca != nullptr) {
			// Stop the action for which activate is false
			requestStop(&executionList, ca);
		}
	}

	// if the available outlets are equal to the 
	// ones needed to be activated - we select the 
	// one that was activated the earliest
	if (pc > 0 && pc == ac) {

		Action* ts = nullptr;
		for (int i = 0; i < SENSORS_COUNT; i++) {
			Action* c = acandidates[i];

			if (c != nullptr) {
				if (ts != nullptr) {
					if ((*c).st < (*ts).st) {
						ts = c;
					}
				}
				else {
					ts = c;
				}
			}
		}

		if (ts != nullptr) {
			scheduleAction(&executionList, ts);
		}
	}

	(*a).ti = availableActions[PUMP_ACTION].state == MS_CHILD_RUNNING ? settings.siw : settings.sid;
	free(acandidates);
}

//end of sensors

// Display
char* actvalues = (char*)malloc(sizeof(char) * 18);
char* sensorValues = (char*)malloc(sizeof(char) * 25);
char* pumpSensorState = (char*)malloc(sizeof(char) * 25);
char* valvesm = (char*)malloc(sizeof(char) * 25);
char* sinfo1 = (char*)malloc(sizeof(char) * 5);
char* sinfo2 = (char*)malloc(sizeof(char) * 5);
char* sinfo3 = (char*)malloc(sizeof(char) * 5);

const char* _hsResolveSensorInfo(char* target, Sensor* s) {
	if ((*s).active) {
		sprintf(target, "%d%%", (*s).p);
	}
	else {
		return MS_OFF_STRING;
	}
	return target;
}

void drawHomeScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(actvalues, "PA: %d%% PD: %d%%", settings.apv, settings.dapv);
	sprintf(sensorValues, "N: %s M: %s F: %s", _hsResolveSensorInfo(sinfo1, &state.s[MS_SENSOR_NEAR]), _hsResolveSensorInfo(sinfo2, &state.s[MS_SENSOR_MID]), _hsResolveSensorInfo(sinfo3, &state.s[MS_SENSOR_FAR]));
	sprintf(valvesm, "VN: %s VM: %s VF: %s", state.vn ? MS_ON_STRING : MS_OFF_STRING, state.vm ? MS_ON_STRING : MS_OFF_STRING, state.vf ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(pumpSensorState, "PUMP: %s SENSORS: %s", state.p ? MS_ON_STRING : MS_OFF_STRING, state.sa ? MS_ON_STRING : MS_OFF_STRING);
	char* message[] = { actvalues, sensorValues, valvesm, pumpSensorState };
	printAlignedTextStack(&mainCanvas, message, 4, 1, MS_H_CENTER, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, "B1 - settings, B2 - stats", 1, (MS_H_CENTER | MS_V_BOTTOM));
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleHomeScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_STATS_SCREEN;
	}
}

void drawThresholdsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char apv[15], dapv[15];
	sprintf(apv, "APV: %d%%", settings.apv);
	sprintf(dapv, "DAPV: %d%%", settings.dapv);
	char* message[] = { apv, dapv };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_LARGE, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleThresholdsSettingsScreen(int buttonValue) {

	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int upperLimit = settings.dapv - 5;
		int nv = _min((settings.apv + 5) % settings.dapv, upperLimit);
		settings.apv = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int nv = _max(_min((settings.dapv + 5) % 105, 100), settings.apv + 5);
		settings.dapv = nv;

	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putLong(MS_APV_SETTING_KEY, settings.apv);
	preferences.putLong(MS_DAPV_SETTING_KEY, settings.dapv);
	preferences.end();
#endif
}

void drawSensorSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	int circleRadius = 17;
	int spacing = 3;
	int boxWidth = 2 * spacing + 3 * (circleRadius * 2);
	int boxX = SCREEN_WIDTH / 2 - boxWidth / 2 + circleRadius;
	int boxY = circleRadius;

	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* s = &state.s[i];
		bool isActive = (*s).active;
		if ((*s).active) {
			mainCanvas.fillCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		else {

