deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
			mainCanvas.drawCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		int16_t x, y;
		uint16_t w, h;
		char sinfo[5];
		sprintf(sinfo, "%d%%", (*s).p);
		mainCanvas.getTextBounds(isActive ? sinfo : MS_OFF_STRING, 0, 0, &x, &y, &w, &h);
		mainCanvas.setCursor(boxX - w / 2 + w % 2, boxY - h / 2 + h % 2 + FONT_BASELINE_CORRECTION_NORMAL / 2);
		mainCanvas.setTextColor(isActive ? SSD1306_BLACK : SSD1306_WHITE);
		mainCanvas.setTextSize(MS_FONT_TEXT_SIZE_NORMAL);

		if (isActive) {
			mainCanvas.print(sinfo);
		}
		else {
			mainCanvas.print(MS_OFF_STRING);
		}

		mainCanvas.getTextBounds((*s).name, 0, 0, &x, &y, &w, &h);
		mainCanvas.setTextColor(SSD1306_WHITE);
		printPositionedText(&mainCanvas, (*s).name, boxX - w / 2, boxY + circleRadius + spacing + FONT_BASELINE_CORRECTION_NORMAL);

		boxX += circleRadius * 2 + spacing;
	}

	printAlignedText(&mainCanvas, "B1 - Back, B2-B4 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		bool isActive = state.s[MS_SENSOR_FAR].active = !state.s[MS_SENSOR_FAR].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		bool isActive = state.s[MS_SENSOR_MID].active = !state.s[MS_SENSOR_MID].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		bool isActive = state.s[MS_SENSOR_NEAR].active = !state.s[MS_SENSOR_NEAR].active;
		if (!isActive) {
			availableActions[OUTLET_NEAR_ACTION].lst = 0;
			availableActions[OUTLET_NEAR_ACTION].st = 0;
		}

	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putBool(MS_FAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_FAR].active);
	preferences.putBool(MS_MID_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_MID].active);
	preferences.putBool(MS_NEAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_NEAR].active);
	preferences.end();
#endif
}

void drawStatisticsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	printAlignedText(&mainCanvas, "Not implemented", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_CENTER);

	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleStatisticsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_HOME_SCREEN;
	}
}

void drawSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Intervals", "B3 - Sensors", "B4 - Thresholds" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_HOME_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		state.scr = MS_THRESHOLDS_SETTINGS_SCREEN;
	}
}

void drawSensorIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	char pm1[20], pm2[20];
	sprintf(pm1, "Pump off: %d s", settings.sid / 1000);
	sprintf(pm2, "Pump on: %d s", settings.siw / 1000);
	char* message[] = { pm1, pm2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - Edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int step = 10000;
		int upperLimit = 5 * 6 * step;
		int nv = _max((settings.sid + step) % (upperLimit + step), step);
		settings.sid = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int step = 5000;
		int upperLimit = 6 * step;
		int nv = _max((settings.siw + step) % (upperLimit + step), step);
		settings.siw = nv;
	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putULong(MS_SENSOR_INTERVAL_PUMPING, settings.siw);
	preferences.putULong(MS_SENSOR_INTERVAL_DRY, settings.sid);
	preferences.end();
#endif
}

void drawPumpIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char pm1[20], pm2[20];
	sprintf(pm1, "max(T): %d min", settings.pd / 60000);
	sprintf(pm2, "Re-act in: %d min", settings.pi / 60000);
	char* message[] = { pm1, pm2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handlePumpIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int minute = 60000;
		int upperLimit = 5 * minute;
		int nv = _max((settings.pd + minute) % (upperLimit + minute), minute);
		settings.pd = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int minute = 60000;
		int upperLimit = 20 * minute;
		int nv = _max((settings.pi + minute) % (upperLimit + minute), minute);
		settings.pi = nv;
	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putULong(MS_PUMP_MAX_DURATION, settings.pd);
	preferences.putULong(MS_PUMP_REACT_INT_DURATION, settings.pi);
	preferences.end();
#endif
}

void drawIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Pump intervals", "B3 - Sensor intervals" };
	printAlignedTextStack(&mainCanvas, text, 2, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

