deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void handleIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_PUMP_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_INTERVALS_SETTINGS_SCREEN;
	}
}

void startBuildScreen(Action* a) {
	int newValue = readButton();
	if (newValue != button.value) {
		button.hasChanged = true;
	}

	button.value = newValue;
	display.clearDisplay();
}

void tickBuildScreen(Action* a) {
	int screenIndex = state.scr;
	if (screenIndex < SCREENS_COUNT) {
		MSScreen* current = (MSScreen*)&availableScreens[screenIndex];
		(*current).drawUI(a);
		if (button.hasChanged) {
			(*current).handleButtons(button.value);
			button.hasChanged = false;
		}
	}
}

void stopBuildScreen(Action* a) {
	button.hasChanged = false;
	button.value = 0;
}

// end of Display

// Pump
void startPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_HIGH);
	state.p = true;
}

void stopPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);
	state.p = false;
}

void tickPump(Action* a) {
}

//end of pump

// end of Actions

void initActionsList() {
	executionList.availableActions = availableActions;
	executionList.availableActionsCount = ACTIONS_COUNT;
}

void allocateMemPools() {
	availableScreens = (MSScreen*)calloc(SCREENS_COUNT, sizeof(MSScreen));
	availableActions = (Action*)calloc(ACTIONS_COUNT, sizeof(Action));
	state.s = (Sensor*)calloc(SENSORS_COUNT, sizeof(Sensor));
}

void initDisplay(Adafruit_SSD1306* display) {
	if (!(*display).begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
		Serial.println(F("SSD1306 failed"));
		for (;;); // Don't proceed, loop forever
	}
	(*display).clearDisplay();
}

void ms_init() {
	// init must be made with completely dry state values

	initDisplay(&display);
	drawSplashScreen(&display);
	delay(5000);
	drawStartingPromptScreen(&display);

	int bs = 0;
	bool init = false;
	while (true) {
		bs = readButton();
		if (bs > BUTTON_1_LOW && bs < BUTTON_1_HIGH) {
			init = false;
			break;
		}
		else if (bs > BUTTON_2_LOW && bs < BUTTON_2_HIGH) {
			init = true;
			break;
		}
	}
#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
#endif
	sprintf(state.s[MS_SENSOR_NEAR].name, "near");
	sprintf(state.s[MS_SENSOR_MID].name, "mid");
	sprintf(state.s[MS_SENSOR_FAR].name, "far");
	// we start with stored values normally
	if (!init) {

#ifdef ARDUINO_ARCH_ESP32
		state.s[MS_SENSOR_NEAR].dry = preferences.getInt(MS_NEAR_DRY_SETTING_KEY);
		state.s[MS_SENSOR_MID].dry = preferences.getInt(MS_MID_DRY_SETTING_KEY);
		state.s[MS_SENSOR_FAR].dry = preferences.getInt(MS_FAR_DRY_SETTING_KEY);

		state.s[MS_SENSOR_NEAR].wet = preferences.getInt(MS_NEAR_WET_SETTING_KEY);
		state.s[MS_SENSOR_MID].wet = preferences.getInt(MS_MID_WET_SETTING_KEY);
		state.s[MS_SENSOR_FAR].wet = preferences.getInt(MS_FAR_WET_SETTING_KEY);

		state.s[MS_SENSOR_NEAR].active = preferences.getBool(MS_NEAR_ACTIVE_SETTING_KEY, true);
		state.s[MS_SENSOR_MID].active = preferences.getBool(MS_MID_ACTIVE_SETTING_KEY, true);
		state.s[MS_SENSOR_FAR].active = preferences.getBool(MS_FAR_ACTIVE_SETTING_KEY, true);

		settings.apv = preferences.getInt(MS_APV_SETTING_KEY, settings.apv);
		settings.dapv = preferences.getInt(MS_DAPV_SETTING_KEY, settings.dapv);

		settings.pd = preferences.getInt(MS_PUMP_MAX_DURATION, settings.pd);
		settings.pi = preferences.getInt(MS_PUMP_REACT_INT_DURATION, settings.pi);

		settings.sid = preferences.getInt(MS_SENSOR_INTERVAL_DRY, settings.sid);
		settings.siw = preferences.getInt(MS_SENSOR_INTERVAL_PUMPING, settings.siw);
#else
		int nd = 0, md = 0, fd = 0, nw = 0, mw = 0, fw = 0;
		EEPROM.get(0, nd);
		EEPROM.get(sizeof(int), md);
		EEPROM.get(sizeof(int) * 2, fd);
		EEPROM.get(sizeof(int) * 3, nw);
		EEPROM.get(sizeof(int) * 4, mw);
		EEPROM.get(sizeof(int) * 5, fw);
		state.s[MS_SENSOR_NEAR].dry = nd;
		state.s[MS_SENSOR_MID].dry = md;
		state.s[MS_SENSOR_FAR].dry = fd;

		state.s[MS_SENSOR_NEAR].wet = nw;
		state.s[MS_SENSOR_MID].wet = mw;
		state.s[MS_SENSOR_FAR].wet = fw;
#endif
		drawStartingValuesScreen(&display);
		delay(2000);
	}
	else {
		digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
#ifdef ARDUINO_ARCH_ESP32
		preferences.clear();
#else
		for (int i = 0; i < EEPROM.length(); i++) {
			EEPROM.put(i, 0);
	}
#endif
		display.clearDisplay();
		showActionPromptScreen(&display, "B2", "get dry state");
		int br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].dry, &state.s[MS_SENSOR_MID].dry, &state.s[MS_SENSOR_FAR].dry);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_DRY_SETTING_KEY, state.s[MS_SENSOR_NEAR].dry);
		preferences.putInt(MS_MID_DRY_SETTING_KEY, state.s[MS_SENSOR_MID].dry);
		preferences.putInt(MS_FAR_DRY_SETTING_KEY, state.s[MS_SENSOR_FAR].dry);
#else
		EEPROM.put(0, state.s[MS_SENSOR_NEAR].dry);
		EEPROM.put(sizeof(int), state.s[MS_SENSOR_MID].dry);
		EEPROM.put(sizeof(int) * 2, state.s[MS_SENSOR_FAR].dry);
#endif

		// fire buzzer to notify that dry values have been read
		drawDryValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2", "get wet state");
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].wet, &state.s[MS_SENSOR_MID].wet, &state.s[MS_SENSOR_FAR].wet);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_WET_SETTING_KEY, state.s[MS_SENSOR_NEAR].wet);
		preferences.putInt(MS_MID_WET_SETTING_KEY, state.s[MS_SENSOR_MID].wet);
		preferences.putInt(MS_FAR_WET_SETTING_KEY, state.s[MS_SENSOR_FAR].wet);
#else
		EEPROM.put(sizeof(int) * 3, state.s[MS_SENSOR_NEAR].wet);
		EEPROM.put(sizeof(int) * 4, state.s[MS_SENSOR_MID].wet);
		EEPROM.put(sizeof(int) * 5, state.s[MS_SENSOR_FAR].wet);
#endif


		// wet values have been read
		drawWetValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2", "start...");
		// click to continue
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}

		digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
}
#ifdef ARDUINO_ARCH_ESP32
	preferences.end();
#endif

}

void setup() {
	pinMode(PIN_FAR, INPUT);
	pinMode(PIN_MID, INPUT);
	pinMode(PIN_NEAR, INPUT);

	pinMode(PIN_VALVE_FAR, OUTPUT);
	pinMode(PIN_VALVE_MID, OUTPUT);
	pinMode(PIN_VALVE_NEAR, OUTPUT);

	digitalWrite(PIN_VALVE_FAR, HIGH);
	digitalWrite(PIN_VALVE_MID, HIGH);
	digitalWrite(PIN_VALVE_NEAR, HIGH);

	pinMode(BUTTONS_PIN, INPUT);

	pinMode(PUMP_PIN, OUTPUT); // pump relay
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);

	pinMode(SENSOR_PIN, OUTPUT); // sensor relay
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	Serial.begin(9600);

	allocateMemPools();

	ms_init();

	initActionsList();
	setupInitialState();
}

void loop() {
	doQueueActions(&executionList);
}
